#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dcentric-health/dev-vault-gh-actions/runs/run-Ux3SdxtBofkRMWSt

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.aws_vpc.default: Reading...
data.aws_ami.selected: Reading...
data.aws_ami.selected: Read complete after 1s [id=ami-0abf31bbb4a1b93e2]
data.aws_vpc.default: Read complete after 1s [id=vpc-ff49b386]
data.aws_subnet_ids.all: Reading...
module.loadbalancer_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-02b8d16426345d0f6]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120230131073805731100000003/77118beb489804c1]
module.instance_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-04c6b6182db5d96ef]
data.aws_subnet_ids.all: Read complete after 0s [id=vpc-ff49b386]
module.loadbalancer_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-4242469831]
module.loadbalancer_sg.aws_security_group_rule.computed_egress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-3874038798]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:loadbalancer/app/vault-dev-stack/b4b9b83012f89a85]
module.instance_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-679899103]
module.instance_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-2285027880]
aws_launch_template.this: Refreshing state... [id=lt-00d0c94022e74fd3e]
module.instance_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3419748485]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:listener/app/vault-dev-stack/b4b9b83012f89a85/953e76ba4e9a578e]
aws_cloudformation_stack.this: Refreshing state... [id=arn:aws:cloudformation:eu-west-1:277142373668:stack/vault-dev-stack/a1b08a30-a13a-11ed-a5b0-0af47ae69fd5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_cloudformation_stack.this will be updated in-place
  ~ resource "aws_cloudformation_stack" "this" {
        id                 = "arn:aws:cloudformation:eu-west-1:277142373668:stack/vault-dev-stack/a1b08a30-a13a-11ed-a5b0-0af47ae69fd5"
        name               = "vault-dev-stack"
        tags               = {}
      ~ template_body      = <<-EOT
            Resources:
              ASG:
                Type: AWS::AutoScaling::AutoScalingGroup
                Properties:
                  AutoScalingGroupName: "vault-dev-stack"
                  HealthCheckGracePeriod: 300
                  DesiredCapacity: 2
                  MaxSize: 2
                  MinSize: 2
                  VPCZoneIdentifier: ["subnet-51d5e237","subnet-5315131b","subnet-6d0f7f37"]
                  TargetGroupARNs: ["arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120230131073805731100000003/77118beb489804c1"]
                  Tags: []
                  HealthCheckType: EC2
            
                  MixedInstancesPolicy:
                    InstancesDistribution:
                      OnDemandBaseCapacity: 2
                      OnDemandPercentageAboveBaseCapacity: 100
                    LaunchTemplate:
                      LaunchTemplateSpecification:
                        LaunchTemplateName: "vault-dev-stack20230131073807735800000004"
                        Version: "9"
                      Overrides: []
            
                UpdatePolicy:
                  AutoScalingScheduledAction:
                    IgnoreUnmodifiedGroupSizeProperties: true
                  AutoScalingRollingUpdate:
                    PauseTime: PT5M
                    SuspendProcesses:
                      - HealthCheck
                      - ReplaceUnhealthy
                      - AZRebalance
                      - AlarmNotification
                      - ScheduledActions
                DeletionPolicy: Delete
        EOT -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-00d0c94022e74fd3e"
      ~ image_id                = "ami-0a0b7f5810548ee1b" -> "ami-0abf31bbb4a1b93e2"
      ~ latest_version          = 9 -> (known after apply)
        name                    = "vault-dev-stack20230131073807735800000004"
        tags                    = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:listener/app/vault-dev-stack/b4b9b83012f89a85/953e76ba4e9a578e"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120230131073805731100000003/77118beb489804c1" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.alb.aws_lb_target_group.main[0] must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120230131073805731100000003/77118beb489804c1" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/h120230131073805731100000003/77118beb489804c1" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120230131073805731100000003/77118beb489804c1" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "h120230131073805731100000003" -> (known after apply)
      ~ name_prefix                        = "h1" -> "api-" # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      ~ tags                               = {
          ~ "Name" = "h1" -> "api-"
        }
      ~ tags_all                           = {
          ~ "Name" = "h1" -> "api-"
        }
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200-399" -> "200-401"
          ~ timeout             = 6 -> 12
            # (7 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

      ~ target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # module.instance_sg.aws_security_group_rule.egress_rules[0] must be replaced
-/+ resource "aws_security_group_rule" "egress_rules" {
      ~ description              = "HTTPS" -> "All protocols"
      ~ from_port                = 443 -> -1 # forces replacement
      ~ id                       = "sgrule-679899103" -> (known after apply)
      ~ protocol                 = "tcp" -> "-1" # forces replacement
      + security_group_rule_id   = (known after apply)
      + source_security_group_id = (known after apply)
      ~ to_port                  = 443 -> -1 # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.loadbalancer_sg.aws_security_group_rule.computed_egress_with_source_security_group_id[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_security_group_rule" "computed_egress_with_source_security_group_id" {
      - description              = "Egress Rule" -> null
      - from_port                = 80 -> null
      - id                       = "sgrule-3874038798" -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-02b8d16426345d0f6" -> null
      - security_group_rule_id   = "sgr-09e84c90621ca4554" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-04c6b6182db5d96ef" -> null
      - to_port                  = 80 -> null
      - type                     = "egress" -> null
    }

  # module.loadbalancer_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = "sg-02b8d16426345d0f6"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

Plan: 3 to add, 3 to change, 3 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Ux3SdxtBofkRMWSt/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Ux3SdxtBofkRMWSt/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Deprecated Resource
│ 
│   with data.aws_subnet_ids.all,
│   on data.tf line 5, in data "aws_subnet_ids" "all":
│    5: data "aws_subnet_ids" "all" {
│ 
│ The aws_subnet_ids data source has been deprecated and will be removed in a
│ future version. Use the aws_subnets data source instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pushed by: @linerocks, Action: `pull_request`*